Config/Catalogs/ФорматыВыгрузкиБухгалтерскойОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ФорматыВыгрузкиБухгалтерскойОтчетности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеВнешнейОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОФайле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбОбработке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Справка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматУстарел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательОтчетности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможнаВыгрузкаПрисоединенныхФайлов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоддерживаемыеСпособыОтправки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособОтправки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВыгрузкиФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоддерживаемыеВидыОтчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодВидаОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНастройкиФормата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначенияХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбиратьИзСписка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокВыбораХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчаниюХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапоминатьЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ФорматыВыгрузкиБухгалтерскойОтчетности/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем СтруктураПараметровДляОбновленияФормата Экспорт; //для обновления формата

////////////////////////////////////////////////////////////////////////////////
// Обновление данных из обработок

Процедура ЗарегистрироватьОбработку(ДанныеРегистрации) Экспорт 
	
	ДанныеОбработки = Новый Структура;
	ДанныеОбработки.Вставить("ИмяФайла","");
	ДанныеОбработки.Вставить("ИнформацияОФайле","");
	ДанныеОбработки.Вставить("ХранилищеВнешнейОбработки");
	ДанныеОбработки.Вставить("Обработка");	
	
		
	ДанныеОбработки.ИмяФайла = ДанныеРегистрации.СтруктураПутиФайла.Имя;
	
	ДвоичныеДанныеОбработки = ПолучитьИзВременногоХранилища(ДанныеРегистрации.АдресДанныхОбработки);
	ПутьВременногоФайла = ПолучитьИмяВременногоФайла(".epf");
	ДвоичныеДанныеОбработки.Записать(ПутьВременногоФайла);
	
	ДанныеФайла = Новый Файл(ПутьВременногоФайла);
	ДанныеОбработки.ИнформацияОФайле = "Размер: " + ДанныеФайла.Размер()+" байт; сохранен в ИБ: " + ТекущаяДата();
	
	ДанныеОбработки.ХранилищеВнешнейОбработки = Новый ХранилищеЗначения(ДвоичныеДанныеОбработки);
	
	Попытка
		ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьВременногоФайла);
	Исключение
		ВызватьИсключение НСтр("ru = 'Внешняя обработка не предназначена для использования в данной конфигурации.'");
	КонецПопытки;
	
	ДанныеОбработки.Обработка = ВнешняяОбработка;
		
	ОбновитьДанныеИзОбработки(ДанныеОбработки);
		
	УдалитьФайлы(ПутьВременногоФайла);
	
КонецПроцедуры

Процедура ОбновитьОбработку() Экспорт
	
	Если Не Предопределенный И Не ЗначениеЗаполнено(ИмяФайла) Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеОбработки = Новый Структура;
	ДанныеОбработки.Вставить("ИмяФайла","");
	ДанныеОбработки.Вставить("ИнформацияОФайле","");
	ДанныеОбработки.Вставить("ХранилищеВнешнейОбработки");
	ДанныеОбработки.Вставить("Обработка");
	
	ЗаполнитьЗначенияСвойств(ДанныеОбработки,ЭтотОбъект,"ИмяФайла,ИнформацияОФайле,ХранилищеВнешнейОбработки");
	
	
	Если Предопределенный Тогда 
		ВнешняяОбработка = Справочники.ФорматыВыгрузкиБухгалтерскойОтчетности.ПолучитьПредопределеннуюОбработкуПоСсылке(Ссылка).Создать(); //этот всегда записан так что ссылка точно есть
		
		НужноУдалить = Ложь;
		
	Иначе 
		ПутьВременногоФайла = ПолучитьИмяВременногоФайла(".epf");
		ДвоичныеДанныеОбработки = ЭтотОбъект.ХранилищеВнешнейОбработки.Получить();
		Если ДвоичныеДанныеОбработки = Неопределено Тогда 
			Возврат;
		КонецЕсли;	
		ДвоичныеДанныеОбработки.Записать(ПутьВременногоФайла);
		ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьВременногоФайла); 
		
		НужноУдалить = Истина;
		
	КонецЕсли;	
	
	Попытка
		Если ТипЗнч(СтруктураПараметровДляОбновленияФормата) = Тип("Структура") Тогда
			//заполнение параметров для более быстрого обновления форматов
			ЗаполнитьЗначенияСвойств(ВнешняяОбработка,СтруктураПараметровДляОбновленияФормата);
		КонецЕсли;
	Исключение
		//не критично
	КонецПопытки;
	
	ДанныеОбработки.Обработка = ВнешняяОбработка;
	
	ОбновитьДанныеИзОбработки(ДанныеОбработки);
	
	Если НужноУдалить Тогда
		УдалитьФайлы(ПутьВременногоФайла);	
	КонецЕсли;
КонецПроцедуры	

Процедура ОбновитьДанныеИзОбработки(ДанныеОбработки)
	
	ПоддерживаемыеСпособыОтправки.Очистить();
	ПоддерживаемыеВидыОтчетов.Очистить();
	ДополнительныеНастройкиФормата.Очистить();
	
	ДанныеДляЗаполнения = Новый Структура;
	ДанныеДляЗаполнения.Вставить("ИмяФайла","");
	ДанныеДляЗаполнения.Вставить("ИнформацияОФайле","");
	ДанныеДляЗаполнения.Вставить("ХранилищеВнешнейОбработки");
	ДанныеДляЗаполнения.Вставить("ВерсияAPI","3.0");
	
	ДанныеДляЗаполнения.Вставить("Наименование",ЭтотОбъект.Наименование);
	ДанныеДляЗаполнения.Вставить("ИДФормата","");
	ДанныеДляЗаполнения.Вставить("Версия","0.0.0.1");
	ДанныеДляЗаполнения.Вставить("ДатаВступления", '00010101');
	ДанныеДляЗаполнения.Вставить("ИнформацияОбОбработке","");
	ДанныеДляЗаполнения.Вставить("ПолучательОтчетности","");
	ДанныеДляЗаполнения.Вставить("Справка","");
	ДанныеДляЗаполнения.Вставить("ПоддерживаемыеСпособыОтправки"	,ПоддерживаемыеСпособыОтправки.ВыгрузитьКолонки());
	ДанныеДляЗаполнения.Вставить("ПоддерживаемыеВидыОтчетов"			,ПоддерживаемыеВидыОтчетов.ВыгрузитьКолонки());
	ДанныеДляЗаполнения.Вставить("ДополнительныеНастройкиФормата"	,ДополнительныеНастройкиФормата.ВыгрузитьКолонки());
	
	
		
	Если ЗначениеЗаполнено(ДанныеОбработки.ИмяФайла) Тогда
		ЗаполнитьЗначенияСвойств(ДанныеДляЗаполнения, ДанныеОбработки,"ИмяФайла");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеОбработки.ИнформацияОФайле) Тогда
		ЗаполнитьЗначенияСвойств(ДанныеДляЗаполнения, ДанныеОбработки,"ИнформацияОФайле");
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДанныеОбработки.ХранилищеВнешнейОбработки) Тогда
		ЗаполнитьЗначенияСвойств(ДанныеДляЗаполнения, ДанныеОбработки,"ХранилищеВнешнейОбработки");
	КонецЕсли;	
	
	
	ЭтоСтарыеВерсии = ДанныеОбработки.Обработка.Метаданные().Макеты.Найти("ПрограммныеИнтерфейсы") <> Неопределено;
	Если ЭтоСтарыеВерсии Тогда 
		ВерсияAPI = ПолучитьВерсиюАПИСтаройОбработки(ДанныеОбработки.Обработка);
		
	Иначе 
		ВерсияAPI = ДанныеОбработки.Обработка.ПолучитьВерсиюAPI();
		
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ВерсияAPI) Тогда 
		ВызватьИсключение НСтр("ru = 'Не удалось определить версию API.'");
	КонецЕсли;
	
	ДанныеДляЗаполнения.ВерсияAPI = ВерсияAPI;
	
	ДанныеОбработки.Обработка = Справочники.ФорматыВыгрузкиБухгалтерскойОтчетности.ПодключитьОбработкуЧерезПрослойку(ДанныеОбработки.Обработка, ВерсияAPI);
	
	
	ПолучаемыеДанные = СформироватьСтруктуруПолучаемыхДанных();
	
	Попытка 
		ДанныеОбработки.Обработка.ЗаполнитьИнформациюОбработки(ПолучаемыеДанные);
		
	Исключение 
		ВызватьИсключение НСтр("ru = 'Не удалось получить данные обработки.'");
	КонецПопытки;
	
	Если ДанныеОбработки.Обработка.Метаданные().ТабличныеЧасти.Найти("ПрисоединенныеФайлыДляВыгрузки")<> Неопределено Тогда
		ВозможнаВыгрузкаПрисоединенныхФайлов = Истина;
	Иначе
		ВозможнаВыгрузкаПрисоединенныхФайлов = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолучаемыеДанные.ИДФормата) Тогда 
		ЗаполнитьЗначенияСвойств(ДанныеДляЗаполнения,ПолучаемыеДанные,"ИДФормата");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолучаемыеДанные.ДатаВступления) Тогда 
		ЗаполнитьЗначенияСвойств(ДанныеДляЗаполнения,ПолучаемыеДанные,"ДатаВступления");
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ПолучаемыеДанные.Версия) Тогда 
		ЗаполнитьЗначенияСвойств(ДанныеДляЗаполнения,ПолучаемыеДанные,"Версия");
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ПолучаемыеДанные.ИнформацияОбОбработке) Тогда 
		ЗаполнитьЗначенияСвойств(ДанныеДляЗаполнения,ПолучаемыеДанные,"ИнформацияОбОбработке");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолучаемыеДанные.ПолучательОтчетности) Тогда 
		ЗаполнитьЗначенияСвойств(ДанныеДляЗаполнения,ПолучаемыеДанные,"ПолучательОтчетности");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолучаемыеДанные.Справка) Тогда 
		ДанныеДляЗаполнения.Справка = ПолучаемыеДанные.Справка;
	КонецЕсли;

	
	Если ЗначениеЗаполнено(ПолучаемыеДанные.НаименованиеПоУмолчанию) Тогда 
		Если Не ЗначениеЗаполнено(ДанныеДляЗаполнения.Наименование) Тогда 
			ДанныеДляЗаполнения.Наименование = ПолучаемыеДанные.НаименованиеПоУмолчанию;
		КонецЕсли;	
	КонецЕсли;
	
	ЗаполнитьСпособыОтправкиПоПолучаемымДанным(ПолучаемыеДанные,ДанныеДляЗаполнения.ПоддерживаемыеСпособыОтправки);
	ЗаполнитьДопНастройкиПоПолучаемымДанным(ПолучаемыеДанные,ДанныеДляЗаполнения.ДополнительныеНастройкиФормата);
	
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеДляЗаполнения,,"ПоддерживаемыеСпособыОтправки,ПоддерживаемыеВидыОтчетов,ДополнительныеНастройкиФормата");
	ЭтотОбъект.ПоддерживаемыеСпособыОтправки.Загрузить(ДанныеДляЗаполнения.ПоддерживаемыеСпособыОтправки);
	
	ЭтотОбъект.ПоддерживаемыеВидыОтчетов.Очистить();
	
	Если ТипЗнч(ПолучаемыеДанные.ВидыОтчетов) = Тип("Массив") Тогда
		Для Каждого ЭлМас Из ПолучаемыеДанные.ВидыОтчетов Цикл
			СтрТЧ = ЭтотОбъект.ПоддерживаемыеВидыОтчетов.Добавить();
			СтрТЧ.КодВидаОтчета = ЭлМас;
		КонецЦикла;
		ЭтотОбъект.ПоддерживаемыеВидыОтчетов.Свернуть("КодВидаОтчета");
		ЭтотОбъект.ПоддерживаемыеВидыОтчетов.Сортировать("КодВидаОтчета");	
	КонецЕсли;
		
	ЭтотОбъект.ДополнительныеНастройкиФормата.Загрузить(ДанныеДляЗаполнения.ДополнительныеНастройкиФормата);
	
	
КонецПроцедуры

функция ПолучитьВерсиюАПИСтаройОбработки(Обработка)
	
	ДанныеВыбраннойВерсии = Новый Структура();
	ДанныеВыбраннойВерсии.Вставить("ВерсияТекст","");
	ДанныеВыбраннойВерсии.Вставить("ВерсияЧисло",0);
	
	Макет = Обработка.ПолучитьМакет("ПрограммныеИнтерфейсы");
	
	Для Н = 1 По Макет.ВысотаТаблицы Цикл
		
		ИдентификаторИнтерфейса = Макет.Область(Н, 1).Текст;
		Если ИдентификаторИнтерфейса <> "УниверсальнаяОтчетность.ВыгрузкаДанных" Тогда 
			Продолжить;
		КонецЕсли;
		
		ПроверяемаяВерсияТекст = Макет.Область(Н, 2).Текст;
		
		МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПроверяемаяВерсияТекст,".");
		Если МассивПодстрок.Количество() <> 2 Тогда 
			Продолжить; // номер версии АПИ это 2 числа типа "1.00"
		КонецЕсли;
		
		Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(МассивПодстрок[0]) Тогда
			Продолжить;  
		КонецЕсли;
		
		Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(МассивПодстрок[1]) Тогда
			Продолжить;
		КонецЕсли;
		
		ПроверяемаяВерсияЧисло = Число(МассивПодстрок[0])*100 + Число(МассивПодстрок[1]);
		
		Если ПроверяемаяВерсияЧисло > ДанныеВыбраннойВерсии.ВерсияЧисло Тогда 
			ДанныеВыбраннойВерсии.ВерсияТекст = ПроверяемаяВерсияТекст;
			ДанныеВыбраннойВерсии.ВерсияЧисло = ПроверяемаяВерсияЧисло;
		КонецЕсли;	
		
		
		
	КонецЦикла;
	
	Возврат ДанныеВыбраннойВерсии.ВерсияТекст;
	
КонецФункции	


функция СформироватьСтруктуруПолучаемыхДанных()
	
	Результат = Новый Структура();
	Результат.Вставить("НаименованиеПоУмолчанию","");
	Результат.Вставить("ИДФормата","");
	Результат.Вставить("Версия","");
	Результат.Вставить("ДатаВступления", '00010101');
	Результат.Вставить("ИнформацияОбОбработке","");
	Результат.Вставить("ПолучательОтчетности","");
	Результат.Вставить("Справка", "");

	
	Результат.Вставить("СпособыОтправки",Новый Массив);
	Результат.Вставить("ВидыОтчетов",Новый Массив);
	
	Результат.Вставить("ДополнительныеНастройки",Новый ТаблицаЗначений);
	Результат.ДополнительныеНастройки.Колонки.Добавить("Имя"         , Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(255)));
	Результат.ДополнительныеНастройки.Колонки.Добавить("ГруппаПолей" , Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(255)));
	Результат.ДополнительныеНастройки.Колонки.Добавить("Заголовок"   , Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(255)));
	Результат.ДополнительныеНастройки.Колонки.Добавить("Описание"    , Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	Результат.ДополнительныеНастройки.Колонки.Добавить("ТипЗначения" , Новый ОписаниеТипов("ОписаниеТипов"));
	Результат.ДополнительныеНастройки.Колонки.Добавить("СписокВыбора", Новый ОписаниеТипов("СписокЗначений"));
	Результат.ДополнительныеНастройки.Колонки.Добавить("ЗначениеПоУмолчанию");
	Результат.ДополнительныеНастройки.Колонки.Добавить("ЗапоминатьЗначение", Новый ОписаниеТипов("Булево"));
	Результат.ДополнительныеНастройки.Колонки.Добавить("ПроверкаЗаполнения", Новый ОписаниеТипов("Булево"));
	

	
	Возврат Результат;
	
КонецФункции	


Процедура ЗаполнитьСпособыОтправкиПоПолучаемымДанным(ПолучаемыеДанные,ЗаполняемаяТаблица)
	
	Если Не ЗначениеЗаполнено(ПолучаемыеДанные.СпособыОтправки) Тогда 
		Возврат;
	КонецЕсли;	

	ИдетОбновление = ОбновлениеИнформационнойБазы.ВыполняетсяОбновлениеИнформационнойБазы();
	
	Шаблон = НСтр("ru = 'Не найден способ отправки ""%1""'");

	Для Каждого СпособОтправки из ПолучаемыеДанные.СпособыОтправки Цикл 
		
		Если Не ЗначениеЗаполнено(СпособОтправки) Тогда 
			Продолжить;
		КонецЕсли;
		
		Попытка
		    СпособОтправкиСсылка = Перечисления.СпособыВыгрузкиФайлов[СпособОтправки];
		Исключение
			
			Если Не ИдетОбновление Тогда 
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, СокрП(СпособОтправки));
				ОбщегоНазначения.СообщитьПользователю(Текст);
			КонецЕсли;
			
			Продолжить;
			
		КонецПопытки;	
		
		НоваяСтрока = ЗаполняемаяТаблица.Добавить();
		НоваяСтрока.СпособОтправки = СпособОтправкиСсылка;
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ЗаполнитьДопНастройкиПоПолучаемымДанным(ПолучаемыеДанные,ЗаполняемаяТаблица)
	
	Если Не ЗначениеЗаполнено(ПолучаемыеДанные.ДополнительныеНастройки) Тогда 
		Возврат;
	КонецЕсли;	
	
	
	Для Каждого ДополнительнаяНастройка из ПолучаемыеДанные.ДополнительныеНастройки Цикл 
		
		Если Не ЗначениеЗаполнено(ДополнительнаяНастройка.Имя) Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ЗаполняемаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ДополнительнаяНастройка,"Имя,ГруппаПолей,Заголовок,Описание,ЗапоминатьЗначение,ПроверкаЗаполнения");
		НоваяСтрока.ВыбиратьИзСписка = ЗначениеЗаполнено(ДополнительнаяНастройка.СписокВыбора);
		
		НоваяСтрока.ТипЗначенияХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ДополнительнаяНастройка.ТипЗначения);
		НоваяСтрока.СписокВыбораХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ДополнительнаяНастройка.СписокВыбора);
		НоваяСтрока.ЗначениеПоУмолчаниюХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ДополнительнаяНастройка.ЗначениеПоУмолчанию);
		
	КонецЦикла;	
	
КонецПроцедуры	

//Обновление данных из обработок
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ



Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	

	
	Если не Предопределенный и не ЗначениеЗаполнено(ИмяФайла) Тогда 
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не загружен файл обработки.'"),ЭтотОбъект);
		Отказ = Истина;
		
	КонецЕсли;
	

	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
